---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsTypeParam
source: html/9bead24e-1275-6422-db75-ae683d6c959b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsTypeParam Property

"Family"

## Syntax (C#)
```csharp
public static ForgeTypeId HandrailSupportsTypeParam { get; }
```